OF_Turorial_02/cavity/constant/testProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      trestProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

myName      buaaymh;

gamma       1.4;

yourBool    on;

yourList    (1.0 2.0 3.0 4.0);

yourVector  (1.1  2.2  3.3);

yourTensor  (1 2 3 4 5 6 7 8 9);


// ************************************************************************* //
